# ExportLayerTable Constructor

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportLayerTable Constructor
ExportLayerTable Class See Also
---
Constructs a new ExportLayerTable with default values.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ExportLayerTable()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ExportLayerTable()
```

# See Also
ExportLayerTable Class
Autodesk.Revit.DB Namespace